def genMobileNum():
    mobilePrefix = ["操你妈","学什么不好学这个","你从你妈屁眼里掏的代码就想骗人？","你先把自己亲妈杀了再滚出来","回你妈子宫里深造一下吧","你妈死了","你想要你妈几成熟？","不好意思你妈火化的时候烤糊了","烧你妈的时候火开大了你凑合吃","你妈尸体没熟呢你就吃？","你死了以后联合国给妈降半旗，因为你免费卖淫给非洲人操，救活一大堆难民","你从你妈长满蛆的烂臭逼里出来看你完成你妈死前的活替你妈卖逼","我空降你爹葬礼用你妈子宫弹奏一首dj版求佛为你爹的亡灵超度","我手持方天画戟在你妈逼里肆无忌惮的挥舞 最后给你妈子宫内壁留下了不可磨灭的痕迹","西湖歌舞几时休 你🐴坟头黄鹤楼","别人开店叫便利店，你开店叫妈逼专卖店。","你从你妈长满蛆的烂臭逼里出来看你完成你妈死前的活替你妈卖逼","我把你马挂在迎客松上喜迎八方来客","请让我先捅烂你亲妈臭逼为敬","你婊子妈在阴间卖逼死也不改老本行。"]
    return random.choice(mobilePrefix)

def genQQmail():
    qqNum = str(random.randint(10000000,9999999999))
    return qqNum+"@qq.com"

def randomDC():
    DCList = ["建议你今天跟你亲妈一起下葬，在棺材里合奏一曲阴风破","我操你妈的逼，一脚给你妈逼踹开花了，跟他妈你现在脸盘子一边大","你妈今天都要下葬了你怎么还在这里网上冲浪啊？火葬场要下班了哦还不赶紧看看你那骨灰飘零的老母亲？","我拿着阴阳斩龙斧把你娘的狗头撕裂后无形坠入到了万丈深渊里被深渊巨鲨撕咬的粉身碎骨最后被土崩瓦解了","杂种滚回你妈子宫回炉重造","你这个狗杂种还真是死皮赖脸 我在你亲妈嘴里拉了稀屎 看她气喘盱盱的样子就知道她吃的非常痛快"]
    return random.choice(DCList)

def randomServer():
    serverList = ["你赶紧去转发几条锦鲤，保佑你吗今晚不死","你妈是佛，你妈不入地狱谁入地狱","你吗生你的时候菜花挤你脑子了吧","你这种烂货，完全是当今社会的毒瘤，老子要在你狗脑子上面安一个定时炸弹，3次密码不对，马上爆炸，正好为社会除害。","你妈逼里有黄金我就是黄金矿工把你妈的子宫都勾出来看看是什么得天独厚的臭逼生出了你这个狗东西","我给你妈一扁担打的她不止天上宫阙是几何","我也是一脚踢碎你婊子妈的子宫生怕你婊子妈在生出来和你一样的弱智","我家小鲤鱼简直想在你妈臭嗨里历险。","傻儿子快来你婊子妈在爹胯下疯狂输出说要见你最后一面要跟你爹我决战到天亮","我素质低？我是没有素质 操你妈都是轻的 我操你的血妈","你妈阴道长了个淋毒脓包，后来医生动手术割下来，你爸把这个脓包养大了，就是现在的你"]
    return random.choice(serverList)
    
